{
  "categories": [
    {
      "name": "Infrastructure & Developer Tools",
      "description": "Tools and frameworks that make AI development more reliable.",
      "projects": [
        {
          "title": "Agent Drift Mitigation System",
          "description": "A framework that keeps AI coding assistants on track during long sessions. Uses vector databases, semantic search, and hooks to automatically remind agents of project rules and patterns they'd otherwise forget.",
          "tags": ["Python", "LanceDB", "MCP", "Hooks"]
        },
        {
          "title": "Knowledge Service for AI Agents",
          "description": "A CLI tool and MCP server that feeds coding agents fresh API docs, technology gotchas, and design patterns — with privacy controls to keep sensitive project data from leaking to external services.",
          "tags": ["MCP Server", "CLI", "Knowledge Base", "Privacy"]
        },
        {
          "title": "Sigma Design Suite",
          "description": "Two related specs for AI-assisted development: one turns plain-English app ideas into deterministic React UI code using strict schemas, the other keeps API research, UX patterns, and app blueprints in sync for design-first workflows.",
          "tags": ["PRD", "React", "Architecture", "Code Generation"]
        },
        {
          "title": "UI-First Prototyping Agent",
          "description": "An IDE-native agent that reads PRDs and generates isolated UI prototypes via slash commands, so layouts and flows get validated before any backend wiring or complex state management.",
          "tags": ["VS Code", "Prototyping", "Agentic Workflows"]
        },
        {
          "title": "OpenClaw AI Coding Environment",
          "description": "A local environment wiring external LLMs and Brave API into a unified CLI and VS Code workflow for research, coding, and troubleshooting — focused on reproducible prompts and clean Node tooling.",
          "tags": ["Node.js", "CLI", "VS Code", "Multi-Model"]
        },
        {
          "title": "Deterministic Prompt Engineering Framework",
          "description": "A structured methodology for creating reliable, repeatable prompts across different LLMs. Combines TCRE, PARTS, ReACT, and RAIL frameworks with step-by-step information gathering, scorecard evaluation, and weakness checks. Also packaged as a reusable custom GPT.",
          "tags": ["Prompt Engineering", "Frameworks", "Cross-LLM", "Custom GPT"]
        }
      ]
    },
    {
      "name": "Applications",
      "description": "Apps, content platforms, and creative tools.",
      "projects": [
        {
          "title": "AI Newsletter Platform",
          "description": "A platform for generating and distributing AI-powered newsletters. Features writer personas, content calendars, multi-format import, AI image generation, and Google Workspace integration.",
          "tags": ["React", "Full-Stack", "API Integration", "Content"]
        },
        {
          "title": "Website Redesign Engine",
          "description": "Analyzes websites across six quality dimensions and generates production-ready redesign code. Combines Claude AI for analysis, Playwright for scraping, and Next.js for the interface.",
          "tags": ["Next.js", "TypeScript", "Claude AI", "Automation"]
        },
        {
          "title": "Personal Finance Assistant",
          "description": "A privacy-first expenses app that imports CSV transactions and uses AI for categorization, insights, and gentle coaching — without sending financial data to third parties. Designed for on-device processing.",
          "tags": ["Fintech", "PRD", "Privacy", "AI Assistant"]
        },
        {
          "title": "\"How AI Works\" Newsletter",
          "description": "A magazine-style email newsletter covering AI developments for professors, analysts, managers, and enthusiasts. Written in long-form feature style with validated benchmarks, audience-specific examples, and custom visual assets.",
          "tags": ["Newsletter", "Content Creation", "AI Analysis", "Writing"]
        },
        {
          "title": "CCRDM Character Development Toolkit",
          "description": "A two-part methodology for ultra-realistic character development in screenwriting and film: a Behavior Performance Guide mapping psychological traits to physical acting cues, and a research module that builds narrative arcs, dialogue patterns, and director-ready performance notes.",
          "tags": ["Creative Writing", "Screenwriting", "Psychology", "Methodology"]
        },
        {
          "title": "Business Analytics Dashboard",
          "description": "A cross-platform dashboard built with Flutter for displaying business metrics, analytics charts, and activity feeds. Supports dark and light themes with responsive layouts across mobile, tablet, and desktop.",
          "tags": ["Flutter", "Dashboard", "Analytics", "Cross-Platform"]
        },
        {
          "title": "Professional Services Website Redesign",
          "description": "Assessed and proposed a full redesign for a professional learning and development firm's website — auditing content, structure, and user experience across 16+ pages and delivering a modern, responsive prototype with improved navigation and booking flows.",
          "tags": ["Web Audit", "Redesign", "UX", "Responsive"]
        }
      ]
    },
    {
      "name": "Automation & Business",
      "description": "Workflow automation and business tools.",
      "projects": [
        {
          "title": "Business Automation Suite",
          "description": "Purpose-built tools including a Gmail-to-Notion content extractor, a privacy-first mobile expense analyzer built with Flutter, and an AI-powered research system for business proposals.",
          "tags": ["Automation", "Flutter", "Next.js", "Research"]
        },
        {
          "title": "n8n Automation Lab",
          "description": "A self-hosted n8n setup used as a sandbox to learn and prototype AI-driven automations — combining LLM calls, APIs, and human-in-the-loop steps for real workflow deployments.",
          "tags": ["n8n", "Self-Hosted", "Workflow Design", "AI Integration"]
        },
        {
          "title": "Automation Consulting Blueprint",
          "description": "Researched and structured a lean consulting portfolio around automation case studies. Defined positioning, service packaging, and page layout targeting small firms that need practical AI and workflow help.",
          "tags": ["Consulting", "Strategy", "Portfolio Design"]
        },
        {
          "title": "Email Thread Analyzer",
          "description": "A COSTAR-based prompt tool that takes messy email threads and produces structured breakdowns — summary, issue tracking, people analysis with sentiment, action items with timelines, and resolution status. Outputs both human-readable reports and JSON.",
          "tags": ["Prompt Engineering", "Email Analysis", "Automation", "JSON"]
        },
        {
          "title": "Digital Bank Acquisition Analysis",
          "description": "A full investment committee memorandum for a digital bank acquisition — covering risk assessment, financial projections, technology due diligence, cybersecurity architecture, and a phased deployment strategy with sequential risk retirement.",
          "tags": ["Due Diligence", "Fintech", "Risk Analysis", "Strategy"]
        }
      ]
    },
    {
      "name": "Research & Education",
      "description": "Explorations, teaching, and knowledge sharing.",
      "projects": [
        {
          "title": "LanceDB Multimodal RAG Research",
          "description": "Explored LanceDB and vector querying for RAG setups mixing text, images, and structured data. Mapped how this stack supports local-first or privacy-sensitive assistants for coding docs and knowledge bases.",
          "tags": ["LanceDB", "RAG", "Multimodal", "Research"]
        },
        {
          "title": "AI Training Curriculum",
          "description": "A 15-session training program covering AI fundamentals, prompt engineering, non-determinism, MCP protocols, and enterprise architecture — designed for teaching and mentoring others getting into AI.",
          "tags": ["Education", "Curriculum Design", "Mentorship"]
        },
        {
          "title": "Forensic Anthropology Assessment Framework",
          "description": "An AI-integrated assessment framework for forensic anthropology courses. Built around evidence-anchored tasks, visible reasoning logs, and verification checkpoints designed to keep AI use transparent while maintaining academic rigor. Includes a companion custom GPT for skeletal trauma analysis.",
          "tags": ["Education", "Forensic Science", "Assessment Design", "Custom GPT"]
        },
        {
          "title": "Claude Code Optimization Research",
          "description": "A curated knowledge base documenting best practices for Claude Code — context window management, token optimization techniques, MCP server evaluations, and agentic architecture patterns for efficient AI-assisted development.",
          "tags": ["Claude Code", "Research", "MCP Servers", "Optimization"]
        }
      ]
    }
  ]
}
